using CVMVC.Models;
using Microsoft.AspNetCore.Mvc;
using System.Collections.Generic;
using System.Diagnostics;

namespace CVMVC.Controllers
{
    public class PortfolioController : Controller
    {
        private readonly List<PortfolioModel> _PortfolioList= new List<PortfolioModel>
        {
            new PortfolioModel
            { 
                ID =1,
                Img="portfolio-10.jpg",
                Title="کتاب",
                Type="seo ",
                Date="12 آذر 1400",
                Tec ="HTML5 / PHP / CSS3",
                Maker=" ملیکا ",
                Description="  من یک عدد کتاب چاپ کردم که خیلی خوشگل و گوگولیه"
            },
             new PortfolioModel
            {
                ID=2,
                Description=" کیف تولید شده با چرم طبیعی بز و گاو",
                Img="portfolio-11.jpg",
                Maker="  کلهر",
                Tec="HTML5 / PHP / CSS3",
                 Date="25 آبان 1402",
                Title="کیف",
                Type="graphic webdesign "
            },
            
            new PortfolioModel
            {
                ID=3,
               Description=" نوشیدن چای ، قهوه ، شیر و یا شکلات مایع با دمای مطلوب در هنگام مطالعه یا سر کار برای رفرش شدنمان ضروریست .بارها برای همه ی ما پیش آمده که بدون اینکه متوجه بشیم با نوشیدن جرعه ای چای یا قهوه سرحال شدیم و با راندمان بهتری به فعالیت خودمان ادامه دادیم . محصولی که در تصویر مشاهده فرمودین دارای توان مصرفی 16 وات یک صفحه گرمکن ویژه دارد که با نسبت تبدیل بهینه ی انرژی الکتریکی به انرژی حرارتی، دمای مطلوب نوشیدنی تا 55 درجه سانتیگراد را تا لحظه ای که به برق متصل باشد فراهم میکند و حتی برای گرم کردن غذای سلفون پیچ آلومینیومی هم می تواند مناسب باشد. بسته بندی زیبای این محصول و کارایی آن می تواند هدیه ی مناسب برای عزیزانمان باشد. تذکر این نکته با دریافت نظرات مختلف مصرف کنندگان ضروریست : استفاده طولانی مدت از صفحه گرمکن با استفاده از سیم تبدیل بلند انجام نشود و فقط با کابل اصلی صفحه گرمکن برای استفاده طولانی مدت صفحه را روشن نمایید ، برای استفاده کمتر از دو ساعت کابل تبدیل بلند آسیبی نمیبیند.",
                Img="portfolio-13.jpg",
                Maker=" زری",
                Tec="HTML5 / PHP / CSS3",
               Date="10 دی 1401",
                Title="لیوان",
                Type="mobiledesign webdesign"
            },
              new PortfolioModel
            {
                ID=4,
                Title="قهوه",
               Description=" قَهوِه گونه‌ای نوشیدنی رایج است که از دانه‌های بوداده و آسیاب‌شده گیاه قهوه به‌دست می‌آید. قهوه کمی اسیدی است و به‌علت داشتن کافئین بالا، یک ماده محرک است این نوشیدنی، محبوب‌ترین نوشیدنی گرم در جهان است/nگیاه قهوه بومی یمن و آفریقا است اما بسیار بیش از این مناطق، در مناطق نیمه‌گرمسیری و گرمسیری قاره آمریکا و جنوب‌شرقی آسیا همچنین به‌نسبت کمتر در برخی از نواحی جنوب آسیا مانند هند کشت می‌شود، هنگام رسیدن میوه گیاه قهوه، دانه‌های قهوه را برداشت و فرآوری می‌کنند. دانه‌های قهوه خشک‌شده به درجات مختلف برشته می‌شوند، بسته به عطر و طعم موردنظر، درجه‌بندی‌های پخت گوناگونی برای این محصول درنظر گرفته شده‌است.",
                Img="portfolio-12.jpg",
                Maker=" هلیا",
                Tec="HTML5 / PHP / CSS3",
               Date="30 اسفند 1398",
                Type="webdesign graphic"
            },
             new PortfolioModel
            {
                ID=5,
               Description=" کتابو می‌گیرم دستم و برات تکیه‌ش می‌دم به سینه‌م. یه جوری واسه‌ت نگهش می‌دارم که گردنت درد نگیره وقت خوندن. عینکتو، خودکارتو، بذار همین‌جا توی جیبم. من وایمیسم تا تو بخونی و بخونی و هروقت لازم داشتی خط بکشی و حاشیه نویسی کنی. اصلن هم نگران کتابت نباش! جاش توو بغلِ من امن و راحته. چشات که خسته شد، فقط چراغا رو خاموش کن و بخواب. من هستم. من وایمیسم تا تو برگردی.» اینا رو نوشتم و گذاشتم رو بالشتک کتابی که می‌خواستم به یارِ کتاب‌خونم هدیه بدم. این‌جوری، هم می‌فهمید هدیه‌ش چیه، هم یادِ من می‌افتاد. من و بالشتک کتاب که به فکرشیم. که مهربونیم با اون و کتاباش.",
                Img="portfolio-14.jpg",
                Maker="پریسا",
                Tec="HTML5 / PHP / CSS3",
               Date="25 آبان 1402",
                Title="بومارکر",
                Type="mobiledesign seo"
            },
            new PortfolioModel
            {
                ID=6,
               Description=" قَهوِه گونه‌ای نوشیدنی رایج است که از دانه‌های بوداده و آسیاب‌شده گیاه قهوه به‌دست می‌آید. قهوه کمی اسیدی است و به‌علت داشتن کافئین بالا، یک ماده محرک است این نوشیدنی، محبوب‌ترین نوشیدنی گرم در جهان است/nگیاه قهوه بومی یمن و آفریقا است اما بسیار بیش از این مناطق، در مناطق نیمه‌گرمسیری و گرمسیری قاره آمریکا و جنوب‌شرقی آسیا همچنین به‌نسبت کمتر در برخی از نواحی جنوب آسیا مانند هند کشت می‌شود، هنگام رسیدن میوه گیاه قهوه، دانه‌های قهوه را برداشت و فرآوری می‌کنند. دانه‌های قهوه خشک‌شده به درجات مختلف برشته می‌شوند، بسته به عطر و طعم موردنظر، درجه‌بندی‌های پخت گوناگونی برای این محصول درنظر گرفته شده‌است.",
                Img="portfolio-15.jpg",
                Maker=" هلیا",
                Tec="HTML5 / PHP / CSS3",
               Date="30 اسفند 1398",
                Title="گلدان",
                Type="webdesign graphic"

            },
            new PortfolioModel
            {
                ID=7,
               Description=" نوشیدن چای ، قهوه ، شیر و یا شکلات مایع با دمای مطلوب در هنگام مطالعه یا سر کار برای رفرش شدنمان ضروریست .بارها برای همه ی ما پیش آمده که بدون اینکه متوجه بشیم با نوشیدن جرعه ای چای یا قهوه سرحال شدیم و با راندمان بهتری به فعالیت خودمان ادامه دادیم . محصولی که در تصویر مشاهده فرمودین دارای توان مصرفی 16 وات یک صفحه گرمکن ویژه دارد که با نسبت تبدیل بهینه ی انرژی الکتریکی به انرژی حرارتی، دمای مطلوب نوشیدنی تا 55 درجه سانتیگراد را تا لحظه ای که به برق متصل باشد فراهم میکند و حتی برای گرم کردن غذای سلفون پیچ آلومینیومی هم می تواند مناسب باشد. بسته بندی زیبای این محصول و کارایی آن می تواند هدیه ی مناسب برای عزیزانمان باشد. تذکر این نکته با دریافت نظرات مختلف مصرف کنندگان ضروریست : استفاده طولانی مدت از صفحه گرمکن با استفاده از سیم تبدیل بلند انجام نشود و فقط با کابل اصلی صفحه گرمکن برای استفاده طولانی مدت صفحه را روشن نمایید ، برای استفاده کمتر از دو ساعت کابل تبدیل بلند آسیبی نمیبیند.",
                Img="portfolio-16.jpg",
                Maker=" زری",
                Tec="HTML5 / PHP / CSS3",
               Date="10 دی 1401",
                Title="ماسک صورت",
                Type="mobiledesign webdesign"

            },
          new PortfolioModel
            {
                ID=8,
                Title="بگ پارچه ای",
               Description="  من یک عدد کتاب چاپ کردم که خیلی خوشگل و گوگولیه",
                Img="portfolio-17.jpg",
                Maker=" ملیکا ",
                Tec="HTML5 / PHP / CSS3",
               Date="12 آذر 1400",
                Type="seo "
            },
             new PortfolioModel
            {
                ID=9,
               Description=" کیف تولید شده با چرم طبیعی بز و گاو",
                Img="portfolio-18.jpg",
                Maker="  کلهر",
                Tec="HTML5 / PHP / CSS3",
               Date="25 آبان 1402",
                Title="باکس",
                Type="graphic webdesign "
            }
        };
        public IActionResult Index()
        {
            return View("Portfolio" ,_PortfolioList);
        }
    }
}
